{
    "projects": [
        {
            "id": 1,
            "name": "Game Collection",
            "img": "/assets/gameCollectionProject.png",
            "alt": "Game Collection Project",
            "desc": "I personally liked how I styled this project, it was my first time I felt that I made a nice looking website. A website that allows users to view, create, edit, or delete descriptions of games in a game collection. The Video Games and Board Games pages are the only functional tabs as I plan to add additional game collections in the future. Utilizes a MERN fullstack.",
            "depLink": "https://game-collection-jpeavler2.herokuapp.com/",
            "githubLink": "https://github.com/jpeavler/video-games-api"

        },
        {
            "id": 2,
            "name": "Web Development Terminology",
            "img": "/assets/WebDevTerms.png",
            "alt": "Web Development Terminology Project",
            "desc": "I share this project since this is the most robust project I've made functionally speaking. A Computer Science terminology wiki that allows the user to store terms with their own resources. Once a term is added to the wiki, additional resources can be inserted or removed. Allows user to archive and delete archived terms. The two buttons at top allow the user to hide archived and active terms from view.",
            "depLink": "https://learners-catalog.herokuapp.com/",
            "githubLink": "https://github.com/jpeavler/Learners-Catalog"
        },
        {
            "id": 3,
            "name": "Shop",
            "img": "/assets/Shop.png",
            "alt": "Shop Project",
            "desc": "This project, when complete, will be a demo shopping app. Currently, users can register and log in to create their own items to sell. This is my first project where I've utilized authorization, which leveraged JWT and local storage. Users can view, create, edit, and remove their own products to sell in the shop as well as update their bio and set their profile icon to one of four images. The next step is to create a cart that allows users to add any item within the entire store to their cart for purchase.",
            "depLink": "https://shop-jpeavler.herokuapp.com/",
            "githubLink": "https://github.com/jpeavler/shop"
        },
        {
            "id": 4,
            "name": "Event Scheduler",
            "img": "/assets/EventScheduler.png",
            "alt": "Scheduler Project",
            "desc": "Utilizing react-calendar and its documentation, I was able to dynamically display user created events in a calendar. I like how sharp the presentation inside the calendar looks. The challenge wasn't so much in styling, but understanding the mechanincs (including styling) of react-calendar to best leverage it.",
            "depLink": "https://calendar-event-scheduler.herokuapp.com/",
            "githubLink": "https://github.com/jpeavler/event-scheduler"
        }
    ]
}